; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image4 - mode
	spectrograph0 - mode
	thermograph5 - mode
	infrared2 - mode
	thermograph6 - mode
	image1 - mode
	infrared7 - mode
	infrared3 - mode
	GroundStation3 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 infrared7)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph5)
	(supports instrument1 thermograph6)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 infrared2)
	(supports instrument2 image1)
	(supports instrument2 image4)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
)
(:goal (and
	(pointing satellite0 GroundStation5)
	(have_image Planet6 infrared2)
	(have_image Planet7 image4)
	(have_image Phenomenon8 thermograph5)
	(have_image Star9 infrared7)
	(have_image Star9 infrared3)
	(have_image Star10 thermograph5)
	(have_image Planet11 infrared2)
	(have_image Planet12 image1)
	(have_image Planet12 thermograph5)
	(have_image Phenomenon13 infrared3)
))

)

; plan
1. (turn_to satellite0 groundstation2 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 11
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 11
3. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 11
4. (turn_to satellite0 star10 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star10)
   goals met: 0 of 11
5. (take_image satellite0 star10 instrument1 thermograph5)
   added: (have_image star10 thermograph5)
   goals met: 1 of 11
6. (turn_to satellite0 planet12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet12)
   goals met: 1 of 11
7. (take_image satellite0 planet12 instrument1 thermograph5)
   added: (have_image planet12 thermograph5)
   goals met: 2 of 11
8. (turn_to satellite0 phenomenon8 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 11
9. (take_image satellite0 phenomenon8 instrument1 thermograph5)
   added: (have_image phenomenon8 thermograph5)
   goals met: 3 of 11
10. (turn_to satellite0 groundstation0 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation0)
   goals met: 3 of 11
11. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 3 of 11
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 11
13. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 3 of 11
14. (turn_to satellite0 star9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star9)
   goals met: 3 of 11
15. (take_image satellite0 star9 instrument0 infrared7)
   added: (have_image star9 infrared7)
   goals met: 4 of 11
16. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 11
17. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 11
18. (turn_to satellite0 groundstation2 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation2)
   goals met: 4 of 11
19. (calibrate satellite0 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 4 of 11
20. (turn_to satellite0 phenomenon13 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 11
21. (take_image satellite0 phenomenon13 instrument2 infrared3)
   added: (have_image phenomenon13 infrared3)
   goals met: 5 of 11
22. (turn_to satellite0 planet11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet11)
   goals met: 5 of 11
23. (take_image satellite0 planet11 instrument2 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 6 of 11
24. (turn_to satellite0 planet12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet12)
   goals met: 6 of 11
25. (take_image satellite0 planet12 instrument2 image1)
   added: (have_image planet12 image1)
   goals met: 7 of 11
26. (turn_to satellite0 planet6 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet6)
   goals met: 7 of 11
27. (take_image satellite0 planet6 instrument2 infrared2)
   added: (have_image planet6 infrared2)
   goals met: 8 of 11
28. (turn_to satellite0 planet7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet7)
   goals met: 8 of 11
29. (take_image satellite0 planet7 instrument2 image4)
   added: (have_image planet7 image4)
   goals met: 9 of 11
30. (turn_to satellite0 star9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star9)
   goals met: 9 of 11
31. (take_image satellite0 star9 instrument2 infrared3)
   added: (have_image star9 infrared3)
   goals met: 10 of 11
32. (turn_to satellite0 groundstation5 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation5)
   goals met: 11 of 11
